{"config": [{"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_1", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 32, "batch_input_shape": [null, 3, 64, 64], "input_dtype": "float32", "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_2", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 32, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_3", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_4", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 64, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_5", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 128, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_6", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 128, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_7", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 256, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"nb_col": 3, "trainable": true, "name": "convolution2d_8", "subsample": [1, 1], "init": "glorot_uniform", "activity_regularizer": null, "border_mode": "same", "b_constraint": null, "W_constraint": null, "nb_filter": 256, "W_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null, "nb_row": 3, "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "th", "border_mode": "valid", "name": "maxpooling2d_4", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 256, "W_regularizer": null, "bias": true, "input_dim": 1536, "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 256, "W_regularizer": null, "bias": true, "input_dim": 256, "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_constraint": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_3", "W_constraint": null, "output_dim": 1, "W_regularizer": null, "bias": true, "input_dim": 256, "b_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.2"}